app/controllers/tasks_controller.rb

    def index
        @tasks = Task.all.order(created_at: :desc)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC

    def create
        @task = Task.create(task_params)
---
INSERT INTO "tasks" ("title", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["title", "ジムに2回行く"], ["created_at", "2019-03-21 14:16:15.561070"], ["updated_at", "2019-03-21 14:16:15.561070"], ["user_id", 2]]

    def edit
        @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

    def update
        @task = Task.find(params[:id])
        @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "tasks" SET "content" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["content", "たのしかった"], ["updated_at", "2019-04-14 04:29:30.085014"], ["id", 18]]

    def destroy
        @task = Task.find(params[:id])
        @task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 9]]

    def show
        @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]